###############################################################

company_name_type_0 = "(爱心|安邦|安联|安心|百年|渤海|长生|诚泰|德华安顾|复星保德信|复星联合|光大永明|工银安盛|国富|国华|国任|国泰|海保|和谐|恒大|横琴|弘康|华安|华海|华贵|华泰|华夏|君龙|君康|昆仑|平安|瑞华|瑞泰|三峡|上海|史带|泰康|泰康在线|太平|天安|同方全球|新华|信泰|亚太|阳光|易安|众安在线|招商局仁和|中华联合|中国|中国大地|中国平安|中国人民|中国太平洋|中美联泰大都会|中韩|中荷|中路|中英)(财产|人寿|健康|养老)(保险)(股份有限|有限|有限责任|(中国)有限)(公司)?"

###############################################################
# product expression
product_type = ["(优选|标准)体",
                "嘉多保|康保无忧",
                "基本责任",
                "可选身故责任",
                "可选恶性肿瘤责任",
                "可选特定疾病责任"]
##################################################################
# SA expression

SA_type = [
  "((每(豁免)?(\\d+|[一二三四五六七八九十百千万]+)元(基本|年|合同期交)?保险?(费|金额))|每份)",
  "((基本|年)保险(费|金额)(:|：)?(\\d+|[一二三四五六七八九十百千万]+)元?)"]

################################################################
# age expression


age_title_type = [ ""]

age_type = [
  "年龄",
  "投保年龄",
  "承保年龄",
  "男性年龄",
  "女性年龄",
  "交费方式年龄",
  "性别年龄",
  "投保年龄性别"]

age_cell_type_0 = ["^(0|[1-9][0-9]*){1,3}$",
                   "^(0|[1-9][0-9]*){1,3}$周?岁"]

################################################################
# gender expression
gender_title_type = [
  "性别:男",
  "性别:女"]

gender_type_0 = ["性别",
                 "性别年龄",
                 "投保年龄性别"]

gender_type_1 = "男|女"
################################################################
# NB expressions

NB_title_type = [
  "保(险|障)((期间)|(期限)|(年期))(:|：)?\\d+年",
  "保(险|障)((期间)|(期限)|(年期))(:|：)?至(被保险人年满)?\\d+周?岁",
  "保(险|障)((期间)|(期限)|(年期))(:|：)?终(生|身)"]


NB_type = [     "保险年期",
                "保障年期",
                "保险期间",
                "保障期间",
                "保险期限",
                "保障期限"]

NB_cell_type_0 = ["(\\d+年期)|(至\\d+周?岁)|(终身)|(保\\d+年)" ,
                   "保险期间(：|:)?(至\\d+周?岁)|(终身)|(保\\d+年)",
                   "\\d+年"]

NB_cell_type_1 = [
                  "(\\d+年期)|(至\\d+周?岁)|(终身)|(保\\d+年)" ,
                  "保险期间(：|:)?(至\\d+周?岁)|(终身)|(保\\d+年)" ]
################################################################
# NP expression

NP_title_type = [
  "(缴|交)费((期间)|(期限)|(年期))(:|：)?\\d+年",
  "(缴|交)费((期间)|(期限)|(年期))(:|：)?至(被保险人年满)?\\d+周?岁"]


NP_type =  [
  "缴费期间",
  "缴费年期",
  "缴费方式",
  "交费期间",
  "交费年期",
  "交费期间",
  "交费方式",
  "交费方式投保年龄",
  "交费期间（年）（同主险交费期间）"]

NP_cell_type_0 = ["(\\d+年)|趸交",
                "\\d+年期交",
                "[一二三四五六七八九十]+年交",
                "交清",
                "\\d+年"]

NP_cell_type_1 = [
               "(\\d+年)|趸交",
                "\\d+年期交",
                "[一二三四五六七八九十]+年交",
                "交清"]
################################################################
# extra expression

occupation_type = "承保职业"
plan_type=("计划一|计划二")



